var cityData = [
    {
        "code": "10",
        "sub": [
            {
                "code": "100004",
                "name": "北京"
            }
        ],
        "name": "北京"
    },
    {
        "code": "30",
        "sub": [
            {
                "code": "203002",
                "name": "唐山"
            },
            {
                "code": "203001",
                "name": "石家庄"
            },
            {
                "code": "203003",
                "name": "秦皇岛"
            },
            {
                "code": "203004",
                "name": "邯郸"
            },
            {
                "code": "203005",
                "name": "邢台"
            },
            {
                "code": "203006",
                "name": "保定"
            },
            {
                "code": "203007",
                "name": "张家口"
            },
            {
                "code": "203008",
                "name": "承德"
            },
            {
                "code": "203009",
                "name": "沧州"
            },
            {
                "code": "203010",
                "name": "廊坊"
            },
            {
                "code": "203011",
                "name": "衡水"
            }
        ],
        "name": "河北"
    },
    {
        "code": "50",
        "sub": [
            {
                "code": "205001",
                "name": "沈阳"
            },
            {
                "code": "205002",
                "name": "大连"
            },
            {
                "code": "205003",
                "name": "鞍山"
            },
            {
                "code": "205004",
                "name": "抚顺"
            },
            {
                "code": "205005",
                "name": "本溪"
            },
            {
                "code": "205006",
                "name": "丹东"
            },
            {
                "code": "205007",
                "name": "锦州"
            },
            {
                "code": "205008",
                "name": "营口"
            },
            {
                "code": "205009",
                "name": "阜新"
            },
            {
                "code": "205010",
                "name": "辽阳"
            },
            {
                "code": "205011",
                "name": "盘锦"
            },
            {
                "code": "205012",
                "name": "铁岭"
            },
            {
                "code": "205013",
                "name": "朝阳"
            },
            {
                "code": "205014",
                "name": "葫芦岛"
            }
        ],
        "name": "辽宁"
    },
    {
        "code": "70",
        "sub": [
            {
                "code": "207001",
                "name": "哈尔滨"
            },
            {
                "code": "207002",
                "name": "齐齐哈尔"
            },
            {
                "code": "207003",
                "name": "鸡西"
            },
            {
                "code": "207004",
                "name": "鹤岗"
            },
            {
                "code": "207005",
                "name": "双鸭山"
            },
            {
                "code": "207006",
                "name": "大庆"
            },
            {
                "code": "207007",
                "name": "伊春"
            },
            {
                "code": "207008",
                "name": "佳木斯"
            },
            {
                "code": "207009",
                "name": "七台河"
            },
            {
                "code": "207010",
                "name": "牡丹江"
            },
            {
                "code": "207011",
                "name": "黑河"
            },
            {
                "code": "207012",
                "name": "绥化"
            },
            {
                "code": "207013",
                "name": "大兴安岭"
            }
        ],
        "name": "黑龙江"
    },
    {
        "code": "100",
        "sub": [
            {
                "code": "210001",
                "name": "西安"
            },
            {
                "code": "210002",
                "name": "铜川"
            },
            {
                "code": "210003",
                "name": "宝鸡"
            },
            {
                "code": "210004",
                "name": "咸阳"
            },
            {
                "code": "210005",
                "name": "渭南"
            },
            {
                "code": "210006",
                "name": "延安"
            },
            {
                "code": "210007",
                "name": "汉中"
            },
            {
                "code": "210008",
                "name": "榆林"
            },
            {
                "code": "210009",
                "name": "安康"
            },
            {
                "code": "210010",
                "name": "商洛"
            }
        ],
        "name": "陕西"
    },
    {
        "code": "120",
        "sub": [
            {
                "code": "212001",
                "name": "西宁"
            },
            {
                "code": "212002",
                "name": "海东"
            },
            {
                "code": "212003",
                "name": "海北"
            },
            {
                "code": "212004",
                "name": "黄南"
            },
            {
                "code": "212005",
                "name": "海南"
            },
            {
                "code": "212006",
                "name": "果洛"
            },
            {
                "code": "212007",
                "name": "玉树"
            },
            {
                "code": "212008",
                "name": "海西"
            }
        ],
        "name": "青海"
    },
    {
        "code": "160",
        "sub": [
            {
                "code": "216001",
                "name": "洛阳"
            },
            {
                "code": "216002",
                "name": "平顶山"
            },
            {
                "code": "216005",
                "name": "安阳"
            },
            {
                "code": "216006",
                "name": "濮阳"
            },
            {
                "code": "216007",
                "name": "许昌"
            },
            {
                "code": "216008",
                "name": "漯河"
            },
            {
                "code": "216009",
                "name": "三门峡"
            },
            {
                "code": "216010",
                "name": "南阳"
            },
            {
                "code": "216011",
                "name": "商丘"
            },
            {
                "code": "216012",
                "name": "信阳"
            },
            {
                "code": "216013",
                "name": "周口"
            },
            {
                "code": "216014",
                "name": "驻马店"
            },
            {
                "code": "216015",
                "name": "济源"
            },
            {
                "code": "216016",
                "name": "郑州"
            },
            {
                "code": "216003",
                "name": "焦作"
            },
            {
                "code": "216004",
                "name": "鹤壁"
            },
            {
                "code": "216017",
                "name": "新乡"
            },
            {
                "code": "216018",
                "name": "开封"
            }
        ],
        "name": "河南"
    },
    {
        "code": "180",
        "sub": [
            {
                "code": "218001",
                "name": "武汉"
            },
            {
                "code": "218002",
                "name": "黄石"
            },
            {
                "code": "218003",
                "name": "襄阳"
            },
            {
                "code": "218004",
                "name": "十堰"
            },
            {
                "code": "218005",
                "name": "荆州"
            },
            {
                "code": "218006",
                "name": "宜昌"
            },
            {
                "code": "218007",
                "name": "荆门"
            },
            {
                "code": "218008",
                "name": "鄂州"
            },
            {
                "code": "218009",
                "name": "孝感"
            },
            {
                "code": "218010",
                "name": "黄冈"
            },
            {
                "code": "218011",
                "name": "咸宁"
            },
            {
                "code": "218012",
                "name": "随州"
            },
            {
                "code": "218013",
                "name": "恩施"
            },
            {
                "code": "218014",
                "name": "仙桃"
            },
            {
                "code": "218015",
                "name": "潜江"
            },
            {
                "code": "218016",
                "name": "天门"
            },
            {
                "code": "218017",
                "name": "神农架"
            }
        ],
        "name": "湖北"
    },
    {
        "code": "200",
        "sub": [
            {
                "code": "220001",
                "name": "福州"
            },
            {
                "code": "220004",
                "name": "厦门"
            },
            {
                "code": "220005",
                "name": "三明"
            },
            {
                "code": "220007",
                "name": "泉州"
            },
            {
                "code": "220011",
                "name": "漳州"
            },
            {
                "code": "220013",
                "name": "南平"
            },
            {
                "code": "220019",
                "name": "宁德"
            },
            {
                "code": "220020",
                "name": "龙岩"
            },
            {
                "code": "100276",
                "name": "莆田"
            }
        ],
        "name": "福建"
    },
    {
        "code": "150",
        "sub": [
            {
                "code": "215001",
                "name": "济南"
            },
            {
                "code": "215003",
                "name": "淄博"
            },
            {
                "code": "215004",
                "name": "枣庄"
            },
            {
                "code": "215005",
                "name": "东营"
            },
            {
                "code": "215006",
                "name": "烟台"
            },
            {
                "code": "215007",
                "name": "潍坊"
            },
            {
                "code": "215009",
                "name": "济宁"
            },
            {
                "code": "215010",
                "name": "泰安"
            },
            {
                "code": "215011",
                "name": "日照"
            },
            {
                "code": "215012",
                "name": "莱芜"
            },
            {
                "code": "215013",
                "name": "临沂"
            },
            {
                "code": "215014",
                "name": "德州"
            },
            {
                "code": "215016",
                "name": "滨州"
            },
            {
                "code": "215017",
                "name": "菏泽"
            },
            {
                "code": "215002",
                "name": "青岛"
            },
            {
                "code": "215008",
                "name": "威海"
            },
            {
                "code": "215015",
                "name": "聊城"
            }
        ],
        "name": "山东"
    },
    {
        "code": "220",
        "sub": [
            {
                "code": "222001",
                "name": "南京"
            },
            {
                "code": "222002",
                "name": "无锡"
            },
            {
                "code": "222003",
                "name": "徐州"
            },
            {
                "code": "222004",
                "name": "常州"
            },
            {
                "code": "222005",
                "name": "苏州"
            },
            {
                "code": "222006",
                "name": "南通"
            },
            {
                "code": "222007",
                "name": "连云港"
            },
            {
                "code": "222008",
                "name": "淮安"
            },
            {
                "code": "222009",
                "name": "盐城"
            },
            {
                "code": "222010",
                "name": "扬州"
            },
            {
                "code": "222011",
                "name": "镇江"
            },
            {
                "code": "222012",
                "name": "泰州"
            },
            {
                "code": "222013",
                "name": "宿迁"
            }
        ],
        "name": "江苏"
    },
    {
        "code": "240",
        "sub": [
            {
                "code": "224001",
                "name": "合肥"
            },
            {
                "code": "224002",
                "name": "芜湖"
            },
            {
                "code": "224003",
                "name": "蚌埠"
            },
            {
                "code": "224004",
                "name": "淮南"
            },
            {
                "code": "224005",
                "name": "马鞍山"
            },
            {
                "code": "224006",
                "name": "淮北"
            },
            {
                "code": "224007",
                "name": "铜陵"
            },
            {
                "code": "224008",
                "name": "安庆"
            },
            {
                "code": "224009",
                "name": "黄山"
            },
            {
                "code": "224010",
                "name": "滁州"
            },
            {
                "code": "224011",
                "name": "阜阳"
            },
            {
                "code": "224012",
                "name": "宿州"
            },
            {
                "code": "224013",
                "name": "巢湖"
            },
            {
                "code": "224014",
                "name": "六安"
            },
            {
                "code": "224015",
                "name": "亳州"
            },
            {
                "code": "224016",
                "name": "池州"
            },
            {
                "code": "224017",
                "name": "宣城"
            }
        ],
        "name": "安徽"
    },
    {
        "code": "260",
        "sub": [
            {
                "code": "100008",
                "name": "重庆"
            }
        ],
        "name": "重庆"
    },
    {
        "code": "280",
        "sub": [
            {
                "code": "228001",
                "name": "贵阳"
            },
            {
                "code": "228002",
                "name": "六盘水"
            },
            {
                "code": "228003",
                "name": "遵义"
            },
            {
                "code": "228004",
                "name": "安顺"
            },
            {
                "code": "228005",
                "name": "铜仁"
            },
            {
                "code": "228006",
                "name": "毕节"
            },
            {
                "code": "228007",
                "name": "黔西南"
            },
            {
                "code": "228008",
                "name": "黔东南"
            },
            {
                "code": "228009",
                "name": "黔南"
            }
        ],
        "name": "贵州"
    },
    {
        "code": "300",
        "sub": [
            {
                "code": "230001",
                "name": "南宁"
            },
            {
                "code": "230002",
                "name": "柳州"
            },
            {
                "code": "230003",
                "name": "桂林"
            },
            {
                "code": "230004",
                "name": "梧州"
            },
            {
                "code": "230005",
                "name": "北海"
            },
            {
                "code": "230006",
                "name": "防城港"
            },
            {
                "code": "230007",
                "name": "钦州"
            },
            {
                "code": "230008",
                "name": "贵港"
            },
            {
                "code": "230009",
                "name": "玉林"
            },
            {
                "code": "230010",
                "name": "百色"
            },
            {
                "code": "230011",
                "name": "贺州"
            },
            {
                "code": "230012",
                "name": "河池"
            },
            {
                "code": "230013",
                "name": "来宾"
            },
            {
                "code": "230014",
                "name": "崇左"
            }
        ],
        "name": "广西"
    },
    {
        "code": "320",
        "sub": [
            {
                "code": "232001",
                "name": "台湾"
            },
            {
                "code": "659014",
                "name": "桃园"
            }
        ],
        "name": "台湾"
    },
    {
        "code": "80",
        "sub": [
            {
                "code": "208001",
                "name": "呼和浩特"
            },
            {
                "code": "208002",
                "name": "包头"
            },
            {
                "code": "208003",
                "name": "乌海"
            },
            {
                "code": "208004",
                "name": "赤峰"
            },
            {
                "code": "208005",
                "name": "通辽"
            },
            {
                "code": "208006",
                "name": "鄂尔多斯"
            },
            {
                "code": "208007",
                "name": "呼伦贝尔"
            },
            {
                "code": "208008",
                "name": "巴彦淖尔"
            },
            {
                "code": "208009",
                "name": "乌兰察布"
            },
            {
                "code": "208010",
                "name": "兴安"
            },
            {
                "code": "208011",
                "name": "锡林郭勒"
            },
            {
                "code": "208012",
                "name": "阿拉善"
            }
        ],
        "name": "内蒙古"
    },
    {
        "code": "20",
        "sub": [
            {
                "code": "100006",
                "name": "天津"
            }
        ],
        "name": "天津"
    },
    {
        "code": "40",
        "sub": [
            {
                "code": "204001",
                "name": "太原"
            },
            {
                "code": "204002",
                "name": "大同"
            },
            {
                "code": "204003",
                "name": "阳泉"
            },
            {
                "code": "204004",
                "name": "长治"
            },
            {
                "code": "204005",
                "name": "晋城"
            },
            {
                "code": "204007",
                "name": "朔州"
            },
            {
                "code": "204008",
                "name": "晋中"
            },
            {
                "code": "204009",
                "name": "运城"
            },
            {
                "code": "204012",
                "name": "忻州"
            },
            {
                "code": "204014",
                "name": "临汾"
            },
            {
                "code": "204017",
                "name": "吕梁"
            }
        ],
        "name": "山西"
    },
    {
        "code": "60",
        "sub": [
            {
                "code": "206001",
                "name": "长春"
            },
            {
                "code": "206002",
                "name": "吉林"
            },
            {
                "code": "206003",
                "name": "四平"
            },
            {
                "code": "206004",
                "name": "辽源"
            },
            {
                "code": "206005",
                "name": "通化"
            },
            {
                "code": "206006",
                "name": "白山"
            },
            {
                "code": "206007",
                "name": "松原"
            },
            {
                "code": "206008",
                "name": "白城"
            },
            {
                "code": "206009",
                "name": "延边"
            }
        ],
        "name": "吉林"
    },
    {
        "code": "90",
        "sub": [
            {
                "code": "209001",
                "name": "兰州"
            },
            {
                "code": "209002",
                "name": "嘉峪关"
            },
            {
                "code": "209003",
                "name": "金昌"
            },
            {
                "code": "209004",
                "name": "白银"
            },
            {
                "code": "209005",
                "name": "天水"
            },
            {
                "code": "209006",
                "name": "武威"
            },
            {
                "code": "209007",
                "name": "张掖"
            },
            {
                "code": "209008",
                "name": "平凉"
            },
            {
                "code": "209009",
                "name": "酒泉"
            },
            {
                "code": "209010",
                "name": "庆阳"
            },
            {
                "code": "209011",
                "name": "定西"
            },
            {
                "code": "209012",
                "name": "陇南"
            },
            {
                "code": "209013",
                "name": "临夏"
            },
            {
                "code": "209014",
                "name": "甘南"
            }
        ],
        "name": "甘肃"
    },
    {
        "code": "110",
        "sub": [
            {
                "code": "100243",
                "name": "吴忠"
            },
            {
                "code": "211001",
                "name": "银川"
            },
            {
                "code": "211003",
                "name": "石嘴山"
            },
            {
                "code": "211004",
                "name": "青铜峡"
            },
            {
                "code": "211005",
                "name": "中卫"
            },
            {
                "code": "211006",
                "name": "固原"
            }
        ],
        "name": "宁夏"
    },
    {
        "code": "130",
        "sub": [
            {
                "code": "213001",
                "name": "拉萨"
            },
            {
                "code": "213002",
                "name": "昌都"
            },
            {
                "code": "213003",
                "name": "山南"
            },
            {
                "code": "213004",
                "name": "日喀则"
            },
            {
                "code": "213005",
                "name": "那曲"
            },
            {
                "code": "213006",
                "name": "阿里"
            },
            {
                "code": "213007",
                "name": "林芝"
            }
        ],
        "name": "西藏"
    },
    {
        "code": "170",
        "sub": [
            {
                "code": "217001",
                "name": "长沙"
            },
            {
                "code": "217002",
                "name": "株洲"
            },
            {
                "code": "217003",
                "name": "湘潭"
            },
            {
                "code": "217004",
                "name": "衡阳"
            },
            {
                "code": "217005",
                "name": "邵阳"
            },
            {
                "code": "217006",
                "name": "岳阳"
            },
            {
                "code": "217007",
                "name": "常德"
            },
            {
                "code": "217008",
                "name": "张家界"
            },
            {
                "code": "217009",
                "name": "益阳"
            },
            {
                "code": "217010",
                "name": "郴州"
            },
            {
                "code": "217011",
                "name": "永州"
            },
            {
                "code": "217012",
                "name": "怀化"
            },
            {
                "code": "217013",
                "name": "娄底"
            },
            {
                "code": "217014",
                "name": "湘西"
            }
        ],
        "name": "湖南"
    },
    {
        "code": "190",
        "sub": [
            {
                "code": "219001",
                "name": "南昌"
            },
            {
                "code": "219002",
                "name": "景德镇"
            },
            {
                "code": "219003",
                "name": "萍乡"
            },
            {
                "code": "219004",
                "name": "九江"
            },
            {
                "code": "219005",
                "name": "新余"
            },
            {
                "code": "219006",
                "name": "鹰潭"
            },
            {
                "code": "219007",
                "name": "赣州"
            },
            {
                "code": "219008",
                "name": "吉安"
            },
            {
                "code": "219009",
                "name": "宜春"
            },
            {
                "code": "219010",
                "name": "抚州"
            },
            {
                "code": "219011",
                "name": "上饶"
            }
        ],
        "name": "江西"
    },
    {
        "code": "140",
        "sub": [
            {
                "code": "214006",
                "name": "阿克苏"
            },
            {
                "code": "214008",
                "name": "克孜勒苏柯尔克孜"
            },
            {
                "code": "214009",
                "name": "巴音郭楞蒙古"
            },
            {
                "code": "214011",
                "name": "博尔塔拉蒙古"
            },
            {
                "code": "214012",
                "name": "伊犁哈萨克"
            },
            {
                "code": "214013",
                "name": "塔城"
            },
            {
                "code": "214014",
                "name": "阿勒泰"
            },
            {
                "code": "214015",
                "name": "石河子"
            },
            {
                "code": "214016",
                "name": "阿拉尔"
            },
            {
                "code": "214017",
                "name": "图木舒克"
            },
            {
                "code": "214018",
                "name": "五家渠"
            },
            {
                "code": "214001",
                "name": "乌鲁木齐"
            },
            {
                "code": "214002",
                "name": "克拉玛依"
            },
            {
                "code": "214003",
                "name": "吐鲁番"
            },
            {
                "code": "214004",
                "name": "哈密"
            },
            {
                "code": "214005",
                "name": "和田"
            },
            {
                "code": "214007",
                "name": "喀什"
            },
            {
                "code": "214010",
                "name": "昌吉"
            }
        ],
        "name": "新疆"
    },
    {
        "code": "210",
        "sub": [
            {
                "code": "221001",
                "name": "杭州"
            },
            {
                "code": "221002",
                "name": "宁波"
            },
            {
                "code": "221003",
                "name": "温州"
            },
            {
                "code": "221004",
                "name": "嘉兴"
            },
            {
                "code": "221005",
                "name": "湖州"
            },
            {
                "code": "221006",
                "name": "绍兴"
            },
            {
                "code": "221007",
                "name": "金华"
            },
            {
                "code": "221008",
                "name": "衢州"
            },
            {
                "code": "221009",
                "name": "舟山"
            },
            {
                "code": "221010",
                "name": "台州"
            },
            {
                "code": "221011",
                "name": "丽水"
            }
        ],
        "name": "浙江"
    },
    {
        "code": "230",
        "sub": [
            {
                "code": "100005",
                "name": "上海"
            }
        ],
        "name": "上海"
    },
    {
        "code": "250",
        "sub": [
            {
                "code": "225003",
                "name": "攀枝花"
            },
            {
                "code": "225010",
                "name": "乐山"
            },
            {
                "code": "225016",
                "name": "雅安"
            },
            {
                "code": "225001",
                "name": "成都"
            },
            {
                "code": "225002",
                "name": "自贡"
            },
            {
                "code": "225004",
                "name": "泸州"
            },
            {
                "code": "225005",
                "name": "德阳"
            },
            {
                "code": "225006",
                "name": "绵阳"
            },
            {
                "code": "225007",
                "name": "广元"
            },
            {
                "code": "225008",
                "name": "遂宁"
            },
            {
                "code": "225009",
                "name": "内江"
            },
            {
                "code": "225011",
                "name": "南充"
            },
            {
                "code": "225012",
                "name": "宜宾"
            },
            {
                "code": "225013",
                "name": "广安"
            },
            {
                "code": "225014",
                "name": "达州"
            },
            {
                "code": "225015",
                "name": "眉山"
            },
            {
                "code": "225017",
                "name": "巴中"
            },
            {
                "code": "225018",
                "name": "资阳"
            },
            {
                "code": "225019",
                "name": "阿坝"
            },
            {
                "code": "225020",
                "name": "甘孜"
            },
            {
                "code": "225021",
                "name": "凉山"
            }
        ],
        "name": "四川"
    },
    {
        "code": "270",
        "sub": [
            {
                "code": "227001",
                "name": "昆明"
            },
            {
                "code": "227002",
                "name": "曲靖"
            },
            {
                "code": "227003",
                "name": "玉溪"
            },
            {
                "code": "227004",
                "name": "保山"
            },
            {
                "code": "227005",
                "name": "昭通"
            },
            {
                "code": "227006",
                "name": "丽江"
            },
            {
                "code": "227007",
                "name": "普洱"
            },
            {
                "code": "227008",
                "name": "临沧"
            },
            {
                "code": "227009",
                "name": "文山"
            },
            {
                "code": "227010",
                "name": "红河"
            },
            {
                "code": "227011",
                "name": "西双版纳"
            },
            {
                "code": "227012",
                "name": "楚雄"
            },
            {
                "code": "227013",
                "name": "大理"
            },
            {
                "code": "227014",
                "name": "德宏"
            },
            {
                "code": "227015",
                "name": "怒江"
            },
            {
                "code": "227016",
                "name": "迪庆"
            }
        ],
        "name": "云南"
    },
    {
        "code": "290",
        "sub": [
            {
                "code": "229013",
                "name": "汕尾"
            },
            {
                "code": "229018",
                "name": "中山"
            },
            {
                "code": "229001",
                "name": "广州"
            },
            {
                "code": "229002",
                "name": "深圳"
            },
            {
                "code": "229003",
                "name": "珠海"
            },
            {
                "code": "229004",
                "name": "汕头"
            },
            {
                "code": "229005",
                "name": "韶关"
            },
            {
                "code": "229006",
                "name": "佛山"
            },
            {
                "code": "229007",
                "name": "江门"
            },
            {
                "code": "229008",
                "name": "湛江"
            },
            {
                "code": "229009",
                "name": "茂名"
            },
            {
                "code": "229010",
                "name": "肇庆"
            },
            {
                "code": "229011",
                "name": "惠州"
            },
            {
                "code": "229012",
                "name": "梅州"
            },
            {
                "code": "229014",
                "name": "河源"
            },
            {
                "code": "229015",
                "name": "阳江"
            },
            {
                "code": "229016",
                "name": "清远"
            },
            {
                "code": "229017",
                "name": "东莞"
            },
            {
                "code": "229019",
                "name": "潮州"
            },
            {
                "code": "229020",
                "name": "云浮"
            },
            {
                "code": "229021",
                "name": "揭阳"
            }
        ],
        "name": "广东"
    },
    {
        "code": "310",
        "sub": [
            {
                "code": "231001",
                "name": "海口"
            },
            {
                "code": "231002",
                "name": "三亚"
            },
            {
                "code": "231003",
                "name": "五指山"
            },
            {
                "code": "231004",
                "name": "琼海"
            },
            {
                "code": "231005",
                "name": "儋州"
            },
            {
                "code": "231006",
                "name": "文昌"
            },
            {
                "code": "231007",
                "name": "万宁"
            },
            {
                "code": "231008",
                "name": "东方"
            }
        ],
        "name": "海南"
    },
    {
        "code": "330",
        "sub": [
            {
                "code": "232002",
                "name": "香港"
            }
        ],
        "name": "香港"
    }
]